from time import time

import tflit

initial = time()
import json
import numpy as np
import sys

# from keras.models import load_model
# from keras.preprocessing.sequence import pad_sequences
# from keras.preprocessing.text import tokenizer_from_json
imported = time()
# model_name = 'best/99.55_train1_dp.2_u120_val.1'
# model_name = 'unroll'

# model = load_model(f'saved_models/{model_name}.h5', compile=False)
# with open('model.tflite', 'rb') as f:
#     tflite_model = f.read()
model = tflit.Model('unrolled.tflite')
# interpreter = tf.lite.Interpreter(model_content=tflite_model)
# interpreter.allocate_tensors()
model_loaded = time()
ngram_factor = (3, 2, 2)

index_word = {
    1: 'о', 2: 'а', 3: 'в', 4: ' ', 5: 'и', 6: 'н', 7: 'р', 8: 'л', 9: 'і', 10: 'к', 11: 'е', 12: 'ч', 13:
    'с', 14: 'д', 15: 'т', 16: 'м', 17: 'й', 18: 'г', 19: 'у', 20: 'я', 21: 'п', 22: 'ь', 23: 'б', 24: 'ю', 25: 'х',
    26: 'ш', 27: 'ї', 28: 'є', 29: 'ц', 30: 'з', 31: 'ф', 32: 'щ', 33: 'ж', 34: '’', 35: "'"
}

word_index = {
    'о': 1, 'а': 2, 'в': 3, ' ': 4, 'и': 5, 'н': 6, 'р': 7, 'л': 8, 'і': 9, 'к': 10, 'е': 11, 'ч': 12, 'с': 13,
    'д': 14, 'т': 15, 'м': 16, 'й': 17, 'г': 18, 'у': 19, 'я': 20, 'п': 21, 'ь': 22, 'б': 23, 'ю': 24, 'х': 25,
    'ш': 26, 'ї': 27, 'є': 28, 'ц': 29, 'з': 30, 'ф': 31, 'щ': 32, 'ж': 33, '’': 34, "'": 35
}

# with open('saved_models/train1_dp.2_u120_val.1.json') as f:
#     tk = tokenizer_from_json(json.load(f))
tk_loaded = time()
encoding_length = len(word_index)
max_length = 12


def get_string_encoded(string):
    data = ' '.join([n[-g:] for n, g in zip(string.lower().split(), ngram_factor)])
    seq = [word_index[s] for s in data]
    # seq = tk.texts_to_sequences(data)
    # padded_seq = pad_sequences([seq], padding='post', maxlen=max_length).tolist()[0]
    i = iter(seq)
    padded_seq = [next(i, 0) for _ in range(max_length)]
    return np.array(one_hot_encode(padded_seq)).reshape((1, 12, 35))


def one_hot_encode(sequence):
    encoded = np.zeros((max_length, encoding_length), dtype=int)
    for pos, val in enumerate(sequence):
        try:
            encoded[pos, val] = 1
        except IndexError:
            continue
    return encoded


def one_hot_decode(encrypted_sequence, input_str):
    decoded_str = "".join([index_word.get(np.argmax(vector), '') for vector in encrypted_sequence])
    return revert_ngram_factor(input_str, decoded_str).title()


def revert_ngram_factor(input_str, decoded_str):
    return ' '.join([x[:-g] + y if g else x + y
                     for x, y, g in zip(input_str.split(), decoded_str.split(), ngram_factor)])


if __name__ == '__main__':
    input_str = sys.argv[1]

    test_data = [['Алійник Михайло Олексійович', 'Алійника Михайла Олексійовича'],
                 ['Арсланалієв Артур Мурадович', 'Арсланалієва Артура Мурадовича'],
                 ['Ассанов Станіслав Олегович', 'Ассанова Станіслава Олеговича'],
                 ['Балабін Микита Андрійович', 'Балабіна Микити Андрійовича'],
                 ['Бермас Микола Олегович', 'Бермаса Миколи Олеговича'],
                 ['Блиндов Микола Вадимович', 'Блиндова Миколи Вадимовича'],
                 ['Богуцький Олександр Миколайович', 'Богуцького Олександра Миколайовича'],
                 ['Борсук Владислав Сергійович', 'Борсука Владислава Сергійовича'],
                 ['Брусковська Катерина Юріївна', 'Брусковської Катерини Юріївни'],
                 ['Васько Яна Віталіївна', 'Васько Яни Віталіївни'],
                 ['Воронкін Дмитро Євгенович', 'Воронкіна Дмитра Євгеновича'],
                 ['Грабовський Сергій Сергійович', 'Грабовського Сергія Сергійовича'],
                 ['Гуменюк Ірина Степанівна', 'Гуменюк Ірини Степанівни'],
                 ['Даниленко Олександр Серійович', 'Даниленка Олександра Серійовича'],
                 ['Данченко Олексій Володимирович', 'Данченка Олексія Володимировича'],
                 ['Дикун Андрій Вячеславович', 'Дикуна Андрія Вячеславовича'],
                 ['Дубас Ярослав Володимирович', 'Дубаса Ярослава Володимировича'],
                 ['Жидун Юрій Васильович', 'Жидуна Юрія Васильовича'],
                 ['Запорожець Ірина Анатоліївна', 'Запорожець Ірини Анатоліївни'],
                 ['Клименко Федор Тарасович', 'Клименка Федора Тарасовича'],
                 ['Комісаренко Олександра Юріївна', 'Комісаренко Олександри Юріївни'],
                 ['Константинов Іван Олександрович', 'Константинова Івана Олександровича'],
                 ['Коншин Олександр Володимирович', 'Коншина Олександра Володимировича'],
                 ['Корнієнко Іван Сергійович', 'Корнієнка Івана Сергійовича'],
                 ['Коровнік Емма Ігорівна', 'Коровнік Емми Ігорівни'],
                 ['Костенко Євген Костянтинович', 'Костенка Євгена Костянтиновича'],
                 ['Кравченко Дмитро Миколайович', 'Кравченка Дмитра Миколайовича'],
                 ['Кузьменко Ігор Олександрович', 'Кузьменка Ігора Олександровича'],
                 ['Куропятник Данило Іванович', 'Куропятника Данила Івановича'],
                 ['Кушнір Олексій Сергійович', 'Кушніра Олексія Сергійовича'],
                 ['Лагно Альона Петрівна', 'Лагно Альони Петрівни'],
                 ['Лащенков Роман Володимирович', 'Лащенкова Романа Володимировича'],
                 ['Литвиненко Олександр Олександрович', 'Литвиненка Олександра Олександровича'],
                 ['Майданенко Володимир Вікторович', 'Майданенка Володимира Вікторовича'],
                 ['Македонська Анна Трифонівна', 'Македонської Анни Трифонівни'],
                 ['Матвейченко Світлана Ігорівна', 'Матвейченко Світлани Ігорівни'],
                 ['Махачек Катерина Володимирівна', 'Махачек Катерини Володимирівни'],
                 ['Мельник Анастасія Віталіївна', 'Мельник Анастасії Віталіївни'],
                 ['Миргородов Євген Павлович', 'Миргородова Євгена Павловича'],
                 ['Мовлян Катерина Сергіївна', 'Мовлян Катерини Сергіївни'],
                 ['Негрій Станіслав Олексійович', 'Негрія Станіслава Олексійовича'],
                 ['Новак Олександр Сергійович', 'Новака Олександра Сергійовича'],
                 ['Оганін Олександр Петрович', 'Оганіна Олександра Петровича'],
                 ['Остапенко Євген Олександрович', 'Остапенка Євгена Олександровича'],
                 ['Остролуцька Євгенія Олександрівна', 'Остролуцької Євгенії Олександрівни'],
                 ['Павленко Віталій Васильович', 'Павленка Віталія Васильовича'],
                 ['Пашура Микита Миколайович', 'Пашури Микити Миколайовича'],
                 ['Перевьорткіна Інна Янівна', 'Перевьорткіної Інни Янівни'],
                 ['Петров Євген Володимирович', 'Петрова Євгена Володимировича'],
                 ['Полубок Артем Михайлович', 'Полубока Артема Михайловича'],
                 ['Попцов Володимир Олександрович', 'Попцова Володимира Олександровича'],
                 ['Працун Дмитро Вікторович', 'Працуна Дмитра Вікторовича'],
                 ['Примак Антон Юрійович', 'Примака Антона Юрійовича'],
                 ['Піддубна Анна Сергіївна', 'Піддубної Анни Сергіївни'],
                 ['Райковський Богдан Володимирович', 'Райковського Богдана Володимировича'],
                 ['Роганов Єгор Володимирович', 'Роганова Єгора Володимировича'],
                 ['Романенко Вікторія Михайлівна', 'Романенко Вікторії Михайлівни'],
                 ['Савеленко Ігор Юрійович', 'Савеленка Ігора Юрійовича'],
                 ['Семенчук Іван Олексійович', 'Семенчука Івана Олексійовича'],
                 ['Стеценко Олександр Олегович', 'Стеценка Олександра Олеговича'],
                 ['Суздал Артем Олександрович', 'Суздала Артема Олександровича'],
                 ['Супроткін Роман Григорович', 'Супроткіна Романа Григоровича'],
                 ['Сурков Дмитро Олександрович', 'Суркова Дмитра Олександровича'],
                 ['Суслов Андрій Миколайович', 'Суслова Андрія Миколайовича'],
                 ['Таркаєв Денис Сергійович', 'Таркаєва Дениса Сергійовича'],
                 ['Ходирєв Андрій Олександрович', 'Ходирєва Андрія Олександровича'],
                 ['Черненко Ростислав Олександрович', 'Черненка Ростислава Олександровича'],
                 ['Шалободін Олександр Олександрович', 'Шалободіна Олександра Олександровича'],
                 ['Шаповал Станіслав Анатолійович', 'Шаповала Станіслава Анатолійовича'],
                 ['Шопіна  Тетяна Миколаївна', 'Шопіної Тетяни Миколаївни'],
                 ['Щерба Ганна Олександрівна', 'Щерби Ганни Олександрівни'],
                 ['Ювченко Олександр Миколайович', 'Ювченка Олександра Миколайовича'],
                 ['Ярема Владислав Олегович', 'Яреми Владислава Олеговича'],
                 ['Ярмоленко Дмитро Андрійович', 'Ярмоленка Дмитра Андрійовича'],
                 ['Єпанчина Анастасія Ігорівна', 'Єпанчиної Анастасії Ігорівни'],
                 ['Ісаєв Андрій Володимирович', 'Ісаєва Андрія Володимировича'],
                 ['Карпець Антон Сергійович', 'Карпця Антона Сергійовича']]

    print(f'Imports {imported-initial}, load model {model_loaded-imported}, load tk {tk_loaded- model_loaded}')

    for input_str in test_data:
        encoded_str = get_string_encoded(input_str[0])

        # t = time()
        prediction = model.predict(encoded_str)
        # print(f'Prediction {time() - t}')

        res = one_hot_decode(prediction[0], input_str[0])
        # print(res)
        if res != input_str[1]:
            print(res, '<-->', input_str[1])
